import 'dart:math';

// exercise 9: cho ma trận tính tổng số các số có giá trị bằng tổng lập phương của các chữ số trong số đó
// vd:
// cho ma trận:
// [
//     [27, 35, 18, 1, 85],
//     [68, 45, 153, 87, 39],
//     [22, 43, 370, 87, 13],
//     [38, 69, 23, 26, 35],
//     [82, 25, 66, 3, 59],
//  ]

// 153 => 1^3 + 5^3 + 3^3 = 153
// 370 => 3^3 + 7^3 + 0^3 = 370
// 1 => 1^1 = 1
// 3 => 3^1 = 3

// => kq: 527

final arr = [
  [27, 35, 18, 1, 85],
  [68, 45, 153, 87, 39],
  [22, 43, 370, 87, 13],
  [38, 69, 23, 26, 35],
  [82, 25, 66, 3, 59],
];

int sumInMaxtrix(List<List<int>> maxtrix) {
  return 0;
}
